iterate/stackchan/experiments/02-minimal-realtime-aec/firmware-sticks3/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# M5StickS3: ESP32-S3-PICO-1-N8R8.
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Native USB is the flash and evidence channel.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# This local proof has no TLS or certificate bundle.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=n
